Revit 2027 API
PresetInitialColor(PresetInitialColor) Constructor
 Creates a copy of the given preset initial color
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PresetInitialColor(
	PresetInitialColor other
)
Public Sub New (
	other As PresetInitialColor
)
public:
PresetInitialColor(
	PresetInitialColor^ other
)
new :
        other : PresetInitialColor -> PresetInitialColor
Parameters
other PresetInitialColor
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PresetInitialColor Class
PresetInitialColor Overload
Autodesk.Revit.DB.Lighting Namespace